app/controllers/news_posts_controller.rb

SELECT "news_posts".* FROM "news_posts"
SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 12]]
SELECT  "news_posts".* FROM "news_posts" ORDER BY total_view DESC LIMIT $1  [["LIMIT", 5]]
---
  def index
    @posts = NewsPost.all
    @posts = @posts.sort_by(&:updated_at).reverse

    @users = User.take(12)
    @most_view_posts = NewsPost.order("total_view DESC").take(5)