app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user[:introduction] = "";
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    if params[:user]
      @user = User.find(params[:id])
      if @user.valid?
        if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 762146111], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", "2020-05-15 06:53:06.300502"], ["id", 762146111]]