app/views/layouts/_posts.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <div class="topnav post-cell-inner">
          <% user = User.find(post.author_id) %>